; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-3-6-7)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	p0-2 - location
	p0-5 - location
	p1-5 - location
	p1-6 - location
	p1-7 - location
	p1-8 - location
	p2-3 - location
	p2-9 - location
	p3-7 - location
	p4-1 - location
	p4-6 - location
	p5-4 - location
	p5-8 - location
	p6-5 - location
	p6-7 - location
	p7-9 - location
	p9-0 - location
	p9-8 - location
	)
	(:init
	(at driver1 s3)
	(at driver2 s0)
	(at driver3 s7)
	(at truck1 s7)
	(empty truck1)
	(at truck2 s7)
	(empty truck2)
	(at truck3 s4)
	(empty truck3)
	(at truck4 s9)
	(empty truck4)
	(at truck5 s6)
	(empty truck5)
	(at truck6 s7)
	(empty truck6)
	(at package1 s6)
	(at package2 s0)
	(at package3 s6)
	(at package4 s0)
	(at package5 s9)
	(at package6 s8)
	(at package7 s2)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(= (time-to-walk s0 p0-2) 90)
	(= (time-to-walk p0-2 s0) 90)
	(= (time-to-walk s2 p0-2) 26)
	(= (time-to-walk p0-2 s2) 26)
	(path s0 p0-5)
	(path p0-5 s0)
	(path s5 p0-5)
	(path p0-5 s5)
	(= (time-to-walk s0 p0-5) 42)
	(= (time-to-walk p0-5 s0) 42)
	(= (time-to-walk s5 p0-5) 7)
	(= (time-to-walk p0-5 s5) 7)
	(path s1 p1-5)
	(path p1-5 s1)
	(path s5 p1-5)
	(path p1-5 s5)
	(= (time-to-walk s1 p1-5) 93)
	(= (time-to-walk p1-5 s1) 93)
	(= (time-to-walk s5 p1-5) 53)
	(= (time-to-walk p1-5 s5) 53)
	(path s1 p1-6)
	(path p1-6 s1)
	(path s6 p1-6)
	(path p1-6 s6)
	(= (time-to-walk s1 p1-6) 62)
	(= (time-to-walk p1-6 s1) 62)
	(= (time-to-walk s6 p1-6) 65)
	(= (time-to-walk p1-6 s6) 65)
	(path s1 p1-7)
	(path p1-7 s1)
	(path s7 p1-7)
	(path p1-7 s7)
	(= (time-to-walk s1 p1-7) 20)
	(= (time-to-walk p1-7 s1) 20)
	(= (time-to-walk s7 p1-7) 28)
	(= (time-to-walk p1-7 s7) 28)
	(path s1 p1-8)
	(path p1-8 s1)
	(path s8 p1-8)
	(path p1-8 s8)
	(= (time-to-walk s1 p1-8) 33)
	(= (time-to-walk p1-8 s1) 33)
	(= (time-to-walk s8 p1-8) 30)
	(= (time-to-walk p1-8 s8) 30)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(= (time-to-walk s2 p2-3) 85)
	(= (time-to-walk p2-3 s2) 85)
	(= (time-to-walk s3 p2-3) 34)
	(= (time-to-walk p2-3 s3) 34)
	(path s2 p2-9)
	(path p2-9 s2)
	(path s9 p2-9)
	(path p2-9 s9)
	(= (time-to-walk s2 p2-9) 74)
	(= (time-to-walk p2-9 s2) 74)
	(= (time-to-walk s9 p2-9) 72)
	(= (time-to-walk p2-9 s9) 72)
	(path s3 p3-7)
	(path p3-7 s3)
	(path s7 p3-7)
	(path p3-7 s7)
	(= (time-to-walk s3 p3-7) 4)
	(= (time-to-walk p3-7 s3) 4)
	(= (time-to-walk s7 p3-7) 26)
	(= (time-to-walk p3-7 s7) 26)
	(path s4 p4-1)
	(path p4-1 s4)
	(path s1 p4-1)
	(path p4-1 s1)
	(= (time-to-walk s4 p4-1) 58)
	(= (time-to-walk p4-1 s4) 58)
	(= (time-to-walk s1 p4-1) 7)
	(= (time-to-walk p4-1 s1) 7)
	(path s4 p4-6)
	(path p4-6 s4)
	(path s6 p4-6)
	(path p4-6 s6)
	(= (time-to-walk s4 p4-6) 56)
	(= (time-to-walk p4-6 s4) 56)
	(= (time-to-walk s6 p4-6) 4)
	(= (time-to-walk p4-6 s6) 4)
	(path s5 p5-4)
	(path p5-4 s5)
	(path s4 p5-4)
	(path p5-4 s4)
	(= (time-to-walk s5 p5-4) 2)
	(= (time-to-walk p5-4 s5) 2)
	(= (time-to-walk s4 p5-4) 59)
	(= (time-to-walk p5-4 s4) 59)
	(path s5 p5-8)
	(path p5-8 s5)
	(path s8 p5-8)
	(path p5-8 s8)
	(= (time-to-walk s5 p5-8) 66)
	(= (time-to-walk p5-8 s5) 66)
	(= (time-to-walk s8 p5-8) 89)
	(= (time-to-walk p5-8 s8) 89)
	(path s6 p6-5)
	(path p6-5 s6)
	(path s5 p6-5)
	(path p6-5 s5)
	(= (time-to-walk s6 p6-5) 41)
	(= (time-to-walk p6-5 s6) 41)
	(= (time-to-walk s5 p6-5) 71)
	(= (time-to-walk p6-5 s5) 71)
	(path s6 p6-7)
	(path p6-7 s6)
	(path s7 p6-7)
	(path p6-7 s7)
	(= (time-to-walk s6 p6-7) 18)
	(= (time-to-walk p6-7 s6) 18)
	(= (time-to-walk s7 p6-7) 70)
	(= (time-to-walk p6-7 s7) 70)
	(path s7 p7-9)
	(path p7-9 s7)
	(path s9 p7-9)
	(path p7-9 s9)
	(= (time-to-walk s7 p7-9) 85)
	(= (time-to-walk p7-9 s7) 85)
	(= (time-to-walk s9 p7-9) 7)
	(= (time-to-walk p7-9 s9) 7)
	(path s9 p9-0)
	(path p9-0 s9)
	(path s0 p9-0)
	(path p9-0 s0)
	(= (time-to-walk s9 p9-0) 95)
	(= (time-to-walk p9-0 s9) 95)
	(= (time-to-walk s0 p9-0) 26)
	(= (time-to-walk p9-0 s0) 26)
	(path s9 p9-8)
	(path p9-8 s9)
	(path s8 p9-8)
	(path p9-8 s8)
	(= (time-to-walk s9 p9-8) 13)
	(= (time-to-walk p9-8 s9) 13)
	(= (time-to-walk s8 p9-8) 88)
	(= (time-to-walk p9-8 s8) 88)
	(link s0 s7)
	(link s7 s0)
	(= (time-to-drive s0 s7) 79)
	(= (time-to-drive s7 s0) 79)
	(link s0 s9)
	(link s9 s0)
	(= (time-to-drive s0 s9) 75)
	(= (time-to-drive s9 s0) 75)
	(link s2 s1)
	(link s1 s2)
	(= (time-to-drive s2 s1) 53)
	(= (time-to-drive s1 s2) 53)
	(link s2 s3)
	(link s3 s2)
	(= (time-to-drive s2 s3) 99)
	(= (time-to-drive s3 s2) 99)
	(link s3 s0)
	(link s0 s3)
	(= (time-to-drive s3 s0) 2)
	(= (time-to-drive s0 s3) 2)
	(link s3 s1)
	(link s1 s3)
	(= (time-to-drive s3 s1) 85)
	(= (time-to-drive s1 s3) 85)
	(link s3 s6)
	(link s6 s3)
	(= (time-to-drive s3 s6) 28)
	(= (time-to-drive s6 s3) 28)
	(link s3 s8)
	(link s8 s3)
	(= (time-to-drive s3 s8) 86)
	(= (time-to-drive s8 s3) 86)
	(link s3 s9)
	(link s9 s3)
	(= (time-to-drive s3 s9) 18)
	(= (time-to-drive s9 s3) 18)
	(link s4 s0)
	(link s0 s4)
	(= (time-to-drive s4 s0) 1)
	(= (time-to-drive s0 s4) 1)
	(link s4 s2)
	(link s2 s4)
	(= (time-to-drive s4 s2) 58)
	(= (time-to-drive s2 s4) 58)
	(link s5 s1)
	(link s1 s5)
	(= (time-to-drive s5 s1) 22)
	(= (time-to-drive s1 s5) 22)
	(link s5 s4)
	(link s4 s5)
	(= (time-to-drive s5 s4) 26)
	(= (time-to-drive s4 s5) 26)
	(link s5 s9)
	(link s9 s5)
	(= (time-to-drive s5 s9) 15)
	(= (time-to-drive s9 s5) 15)
	(link s6 s4)
	(link s4 s6)
	(= (time-to-drive s6 s4) 29)
	(= (time-to-drive s4 s6) 29)
	(link s6 s8)
	(link s8 s6)
	(= (time-to-drive s6 s8) 82)
	(= (time-to-drive s8 s6) 82)
	(link s6 s9)
	(link s9 s6)
	(= (time-to-drive s6 s9) 19)
	(= (time-to-drive s9 s6) 19)
	(link s7 s5)
	(link s5 s7)
	(= (time-to-drive s7 s5) 30)
	(= (time-to-drive s5 s7) 30)
	(link s7 s6)
	(link s6 s7)
	(= (time-to-drive s7 s6) 41)
	(= (time-to-drive s6 s7) 41)
	(link s8 s7)
	(link s7 s8)
	(= (time-to-drive s8 s7) 85)
	(= (time-to-drive s7 s8) 85)
	(link s9 s2)
	(link s2 s9)
	(= (time-to-drive s9 s2) 19)
	(= (time-to-drive s2 s9) 19)
	(link s9 s4)
	(link s4 s9)
	(= (time-to-drive s9 s4) 81)
	(= (time-to-drive s4 s9) 81)
	(link s9 s8)
	(link s8 s9)
	(= (time-to-drive s9 s8) 56)
	(= (time-to-drive s8 s9) 56)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver1 s3)
	(at driver2 s9)
	(at driver3 s6)
	(at truck1 s1)
	(at truck2 s4)
	(at truck3 s0)
	(at truck5 s1)
	(at truck6 s6)
	(at package1 s0)
	(at package2 s4)
	(at package3 s5)
	(at package4 s3)
	(at package5 s0)
	(at package7 s2)
	))

(:metric minimize (+ (+ (* 2  (total-time)) (* 3  (driven))) (* 2  (walked))))

)

; plan
1. (board-truck driver3 truck1 s7)
   deleted: (at driver3 s7) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 2 of 14
2. (walk driver2 s0 p9-0)
   deleted: (at driver2 s0)
   added: (at driver2 p9-0)
   changed: (walked) from 0 to 26
   goals met: 2 of 14
3. (drive-truck truck1 s7 s6 driver3)
   deleted: (at truck1 s7)
   added: (at truck1 s6)
   changed: (driven) from 0 to 41
   goals met: 2 of 14
4. (load-truck package1 truck1 s6)
   deleted: (at package1 s6)
   added: (in package1 truck1)
   goals met: 2 of 14
5. (load-truck package3 truck1 s6)
   deleted: (at package3 s6)
   added: (in package3 truck1)
   goals met: 2 of 14
6. (walk driver1 s3 p3-7)
   deleted: (at driver1 s3)
   added: (at driver1 p3-7)
   changed: (walked) from 26 to 30
   goals met: 1 of 14
7. (drive-truck truck1 s6 s9 driver3)
   deleted: (at truck1 s6)
   added: (at truck1 s9)
   changed: (driven) from 41 to 60
   goals met: 1 of 14
8. (load-truck package5 truck1 s9)
   deleted: (at package5 s9)
   added: (in package5 truck1)
   goals met: 1 of 14
9. (drive-truck truck1 s9 s4 driver3)
   deleted: (at truck1 s9)
   added: (at truck1 s4)
   changed: (driven) from 60 to 141
   goals met: 1 of 14
10. (walk driver2 p9-0 s9)
   deleted: (at driver2 p9-0)
   added: (at driver2 s9)
   changed: (walked) from 30 to 125
   goals met: 2 of 14
11. (drive-truck truck1 s4 s0 driver3)
   deleted: (at truck1 s4)
   added: (at truck1 s0)
   changed: (driven) from 141 to 142
   goals met: 2 of 14
12. (load-truck package2 truck1 s0)
   deleted: (at package2 s0)
   added: (in package2 truck1)
   goals met: 2 of 14
13. (load-truck package4 truck1 s0)
   deleted: (at package4 s0)
   added: (in package4 truck1)
   goals met: 2 of 14
14. (unload-truck package1 truck1 s0)
   deleted: (in package1 truck1)
   added: (at package1 s0)
   goals met: 3 of 14
15. (drive-truck truck1 s0 s9 driver3)
   deleted: (at truck1 s0)
   added: (at truck1 s9)
   changed: (driven) from 142 to 217
   goals met: 3 of 14
16. (walk driver1 p3-7 s3)
   deleted: (at driver1 p3-7)
   added: (at driver1 s3)
   changed: (walked) from 125 to 129
   goals met: 4 of 14
17. (walk driver2 s9 p7-9)
   deleted: (at driver2 s9)
   added: (at driver2 p7-9)
   changed: (walked) from 129 to 136
   goals met: 3 of 14
18. (drive-truck truck1 s9 s4 driver3)
   deleted: (at truck1 s9)
   added: (at truck1 s4)
   changed: (driven) from 217 to 298
   goals met: 3 of 14
19. (unload-truck package2 truck1 s4)
   deleted: (in package2 truck1)
   added: (at package2 s4)
   goals met: 4 of 14
20. (walk driver2 p7-9 s7)
   deleted: (at driver2 p7-9)
   added: (at driver2 s7)
   changed: (walked) from 136 to 221
   goals met: 4 of 14
21. (drive-truck truck1 s4 s5 driver3)
   deleted: (at truck1 s4)
   added: (at truck1 s5)
   changed: (driven) from 298 to 324
   goals met: 4 of 14
22. (unload-truck package3 truck1 s5)
   deleted: (in package3 truck1)
   added: (at package3 s5)
   goals met: 5 of 14
23. (drive-truck truck1 s5 s4 driver3)
   deleted: (at truck1 s5)
   added: (at truck1 s4)
   changed: (driven) from 324 to 350
   goals met: 5 of 14
24. (drive-truck truck1 s4 s6 driver3)
   deleted: (at truck1 s4)
   added: (at truck1 s6)
   changed: (driven) from 350 to 379
   goals met: 5 of 14
25. (disembark-truck driver3 truck1 s6)
   deleted: (driving driver3 truck1)
   added: (at driver3 s6) (empty truck1)
   goals met: 6 of 14
26. (unload-truck package5 truck1 s6)
   deleted: (in package5 truck1)
   added: (at package5 s6)
   goals met: 6 of 14
27. (board-truck driver3 truck1 s6)
   deleted: (at driver3 s6) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 5 of 14
28. (board-truck driver2 truck2 s7)
   deleted: (at driver2 s7) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 5 of 14
29. (drive-truck truck2 s7 s0 driver2)
   deleted: (at truck2 s7)
   added: (at truck2 s0)
   changed: (driven) from 379 to 458
   goals met: 5 of 14
30. (drive-truck truck2 s0 s9 driver2)
   deleted: (at truck2 s0)
   added: (at truck2 s9)
   changed: (driven) from 458 to 533
   goals met: 5 of 14
31. (drive-truck truck2 s9 s6 driver2)
   deleted: (at truck2 s9)
   added: (at truck2 s6)
   changed: (driven) from 533 to 552
   goals met: 5 of 14
32. (drive-truck truck1 s6 s3 driver3)
   deleted: (at truck1 s6)
   added: (at truck1 s3)
   changed: (driven) from 552 to 580
   goals met: 5 of 14
33. (unload-truck package4 truck1 s3)
   deleted: (in package4 truck1)
   added: (at package4 s3)
   goals met: 6 of 14
34. (drive-truck truck1 s3 s1 driver3)
   deleted: (at truck1 s3)
   added: (at truck1 s1)
   changed: (driven) from 580 to 665
   goals met: 7 of 14
35. (load-truck package5 truck2 s6)
   deleted: (at package5 s6)
   added: (in package5 truck2)
   goals met: 7 of 14
36. (drive-truck truck2 s6 s4 driver2)
   deleted: (at truck2 s6)
   added: (at truck2 s4)
   changed: (driven) from 665 to 694
   goals met: 8 of 14
37. (disembark-truck driver3 truck1 s1)
   deleted: (driving driver3 truck1)
   added: (at driver3 s1) (empty truck1)
   goals met: 8 of 14
38. (walk driver3 s1 p1-6)
   deleted: (at driver3 s1)
   added: (at driver3 p1-6)
   changed: (walked) from 221 to 283
   goals met: 8 of 14
39. (walk driver3 p1-6 s6)
   deleted: (at driver3 p1-6)
   added: (at driver3 s6)
   changed: (walked) from 283 to 348
   goals met: 9 of 14
40. (drive-truck truck2 s4 s0 driver2)
   deleted: (at truck2 s4)
   added: (at truck2 s0)
   changed: (driven) from 694 to 695
   goals met: 8 of 14
41. (unload-truck package5 truck2 s0)
   deleted: (in package5 truck2)
   added: (at package5 s0)
   goals met: 9 of 14
42. (drive-truck truck2 s0 s4 driver2)
   deleted: (at truck2 s0)
   added: (at truck2 s4)
   changed: (driven) from 695 to 696
   goals met: 10 of 14
43. (disembark-truck driver2 truck2 s4)
   deleted: (driving driver2 truck2)
   added: (at driver2 s4) (empty truck2)
   goals met: 10 of 14
44. (board-truck driver2 truck3 s4)
   deleted: (at driver2 s4) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 10 of 14
45. (drive-truck truck3 s4 s0 driver2)
   deleted: (at truck3 s4)
   added: (at truck3 s0)
   changed: (driven) from 696 to 697
   goals met: 11 of 14
46. (board-truck driver3 truck5 s6)
   deleted: (at driver3 s6) (empty truck5)
   added: (driving driver3 truck5)
   goals met: 10 of 14
47. (drive-truck truck5 s6 s3 driver3)
   deleted: (at truck5 s6)
   added: (at truck5 s3)
   changed: (driven) from 697 to 725
   goals met: 10 of 14
48. (drive-truck truck5 s3 s1 driver3)
   deleted: (at truck5 s3)
   added: (at truck5 s1)
   changed: (driven) from 725 to 810
   goals met: 11 of 14
49. (disembark-truck driver3 truck5 s1)
   deleted: (driving driver3 truck5)
   added: (at driver3 s1) (empty truck5)
   goals met: 11 of 14
50. (walk driver3 s1 p1-6)
   deleted: (at driver3 s1)
   added: (at driver3 p1-6)
   changed: (walked) from 348 to 410
   goals met: 11 of 14
51. (walk driver3 p1-6 s6)
   deleted: (at driver3 p1-6)
   added: (at driver3 s6)
   changed: (walked) from 410 to 475
   goals met: 12 of 14
52. (drive-truck truck3 s0 s7 driver2)
   deleted: (at truck3 s0)
   added: (at truck3 s7)
   changed: (driven) from 810 to 889
   goals met: 11 of 14
53. (disembark-truck driver2 truck3 s7)
   deleted: (driving driver2 truck3)
   added: (at driver2 s7) (empty truck3)
   goals met: 11 of 14
54. (board-truck driver2 truck6 s7)
   deleted: (at driver2 s7) (empty truck6)
   added: (driving driver2 truck6)
   goals met: 11 of 14
55. (drive-truck truck6 s7 s6 driver2)
   deleted: (at truck6 s7)
   added: (at truck6 s6)
   changed: (driven) from 889 to 930
   goals met: 12 of 14
56. (walk driver3 s6 p6-7)
   deleted: (at driver3 s6)
   added: (at driver3 p6-7)
   changed: (walked) from 475 to 493
   goals met: 11 of 14
57. (walk driver3 p6-7 s7)
   deleted: (at driver3 p6-7)
   added: (at driver3 s7)
   changed: (walked) from 493 to 563
   goals met: 11 of 14
58. (board-truck driver3 truck3 s7)
   deleted: (at driver3 s7) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 11 of 14
59. (drive-truck truck3 s7 s0 driver3)
   deleted: (at truck3 s7)
   added: (at truck3 s0)
   changed: (driven) from 930 to 1009
   goals met: 12 of 14
60. (drive-truck truck6 s6 s9 driver2)
   deleted: (at truck6 s6)
   added: (at truck6 s9)
   changed: (driven) from 1009 to 1028
   goals met: 11 of 14
61. (disembark-truck driver3 truck3 s0)
   deleted: (driving driver3 truck3)
   added: (at driver3 s0) (empty truck3)
   goals met: 11 of 14
62. (drive-truck truck6 s9 s0 driver2)
   deleted: (at truck6 s9)
   added: (at truck6 s0)
   changed: (driven) from 1028 to 1103
   goals met: 11 of 14
63. (disembark-truck driver2 truck6 s0)
   deleted: (driving driver2 truck6)
   added: (at driver2 s0) (empty truck6)
   goals met: 11 of 14
64. (board-truck driver3 truck6 s0)
   deleted: (at driver3 s0) (empty truck6)
   added: (driving driver3 truck6)
   goals met: 11 of 14
65. (walk driver2 s0 p9-0)
   deleted: (at driver2 s0)
   added: (at driver2 p9-0)
   changed: (walked) from 563 to 589
   goals met: 11 of 14
66. (walk driver2 p9-0 s9)
   deleted: (at driver2 p9-0)
   added: (at driver2 s9)
   changed: (walked) from 589 to 684
   goals met: 12 of 14
67. (drive-truck truck6 s0 s9 driver3)
   deleted: (at truck6 s0)
   added: (at truck6 s9)
   changed: (driven) from 1103 to 1178
   goals met: 12 of 14
68. (drive-truck truck6 s9 s6 driver3)
   deleted: (at truck6 s9)
   added: (at truck6 s6)
   changed: (driven) from 1178 to 1197
   goals met: 13 of 14
69. (disembark-truck driver3 truck6 s6)
   deleted: (driving driver3 truck6)
   added: (at driver3 s6) (empty truck6)
   goals met: 14 of 14
